import 'package:flutter/material.dart';

class About_us extends StatelessWidget {
  const About_us({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(title: const Text('About us')),
      body: const Padding(
        padding: EdgeInsets.all(16),
        child: Text(
            '''"السّياحه" هو تطبيق مرشد سياحي مصمم لمساعدتك على استكشاف المدن، المعالم السياحية، والتجارب المحلية بطريقة سهلة وممتعة. من خلال التطبيق، هتلاقي معلومات دقيقة ومحدثة عن أهم الأماكن السياحية، الأنشطة الترفيهية، والمطاعم والأسواق اللي تستحق الزيارة.

هدفنا هو تبسيط رحلتك، وتوفير دليل رقمي متكامل يخليك تعيش تجربة سياحية فريدة، سواء كنت مسافر لأول مرة أو بتستكشف مكان جديد في بلدك.

في "السّساحه"، نستخدم أحدث التقنيات عشان نوفّرلك:

خرائط تفاعلية ودليل خطوة بخطوة.

معلومات صوتية ومرئية عن كل موقع.

توصيات حسب اهتماماتك وموقعك الجغرافي.

دعم للغات متعددة لتجربة أكثر سلاسة.

خلّي رحلتك أذكى وأسهل مع "السّساحه"  معاك في كل خطوة!

'''),
      ),
    );
  }
}
