import 'package:flutter/material.dart';

class TermsAndConditions extends StatelessWidget {
  const TermsAndConditions({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(title: const Text('About us')),
      body: const Padding(
        padding: EdgeInsets.all(16),
        child: Text(
          '''الشروط والأحكام
مرحبًا بك في تطبيق السّساحه. قبل استخدامك للتطبيق، يُرجى قراءة الشروط والأحكام التالية بعناية، حيث يُعد استخدامك للتطبيق بمثابة موافقة منك على الالتزام بها.

1. الاستخدام المقبول
يُمنع استخدام التطبيق لأي أغراض غير قانونية أو مخالفة للأخلاق العامة.

يجب احترام خصوصية الآخرين، والامتناع عن نشر أي محتوى مسيء أو مضلل.

2. حقوق الملكية الفكرية
جميع المحتويات داخل التطبيق (النصوص، الصور، الصوتيات، الفيديوهات) مملوكة لتطبيق "السّساحه" أو مرخصة له، ويُمنع نسخها أو استخدامها بدون إذن مسبق.

3. دقة المعلومات
نحن نحرص على تقديم معلومات دقيقة ومحدثة، لكننا لا نضمن أن جميع البيانات خالية من الأخطاء أو مكتملة في كل الأوقات.

المستخدم يتحمّل مسؤولية استخدام المعلومات واتخاذ القرارات السياحية بناءً عليها.

4. تحديد المسؤولية
"السّساحه" لا يتحمّل أي مسؤولية عن أي خسائر أو أضرار تنشأ عن استخدام التطبيق أو الاعتماد على محتوياته.

قد يحتوي التطبيق على روابط لمواقع أو خدمات خارجية، ولسنا مسؤولين عن محتواها أو ممارساتها.

5. التعديلات
يحتفظ تطبيق "السّساحه" بالحق في تعديل هذه الشروط في أي وقت، وسيتم إشعار المستخدمين بالتغييرات من خلال التطبيق أو البريد الإلكتروني عند اللزوم.

6. الخصوصية
يُرجى مراجعة سياسة الخصوصية لمعرفة كيف يتم جمع واستخدام وحماية بياناتك الشخصية.

7. التواصل
لأي استفسارات أو ملاحظات، يمكنك التواصل معنا عبر البريد الإلكتروني:
support@TourGuide.app
''',
        ),
      ),
    );
  }
}
